# ColorWithTransparency Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorWithTransparency Methods
ColorWithTransparency Class See Also
---
The ColorWithTransparency type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBlue | get blue |
| GetColor | get color |
| GetGreen | get green |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRed | get red |
| GetTransparency | get transparency |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetBlue | set blue |
| SetColor | set color |
| SetGreen | set green |
| SetRed | set red |
| SetTransparency | set transparency |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace